<a href="https://colab.research.google.com/github/Zoyasirguroh/Ejuket_DS_ML/blob/main/Week_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Introduction to Pandas, Series, and DataFrames

#### Goal:
Familiarize  with the Pandas library and its core data structures: Series and DataFrames.


### 1. Overview of Pandas and Its Applications in Data Science
 Pandas is a powerful library for data manipulation and analysis in Python.
 It provides two key data structures:
 - **Series**: One-dimensional labeled arrays.
 - **DataFrame**: Two-dimensional labeled data structures (like a table).

 Pandas is widely used in data preprocessing, cleaning, and exploratory data analysis (EDA).

In [ ]:
import pandas as pd  # Importing the Pandas library


#### 2. Series
 A Pandas Series is a one-dimensional array with labels (called the index). It can hold data of any type (integer, float, string, etc.).

#### a) Creating a Series
 Let's create a Series from a Python list.

In [ ]:

temperatures = [30, 35, 28, 32, 31]  # Example temperature data
temp_series = pd.Series(temperatures, index=["Mon", "Tue", "Wed", "Thu", "Fri"])
print("Temperature Series:")
print(temp_series)

Temperature Series:
Mon    30
Tue    35
Wed    28
Thu    32
Fri    31
dtype: int64


#### b) Accessing Elements by Index
 You can access elements of a Series using:
 - Label-based indexing
 - Position-based indexing

In [ ]:

# Example: Accessing elements
print("\nTemperature on Monday:", temp_series["Mon"])  # By label
print("Temperature on Friday:", temp_series[-1])  # By position

Temperature on Monday: 30
Temperature on Friday: 31

<ipython-input-4-c8dd796bed23>:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("Temperature on Friday:", temp_series[-1])  # By position

#### c) Operations on Series
You can perform element-wise operations on Series, like adding, subtracting, or applying functions.

 Example: Element-wise operation

In [ ]:
print("Temperature Series:")
print(temp_series)
adjusted_temps = temp_series + 2  # Add 2 degrees to each temperature
print("\nAdjusted Temperatures:")
print(adjusted_temps)

Temperature Series:
Mon    30
Tue    35
Wed    28
Thu    32
Fri    31
dtype: int64

Adjusted Temperatures:
Mon    32
Tue    37
Wed    30
Thu    34
Fri    33
dtype: int64


#### 3. DataFrames
 A DataFrame is a two-dimensional data structure with rows and columns, similar to a table in Excel.

##### a) Creating DataFrames
 DataFrames can be created from dictionaries, lists, or files (e.g., CSV/Excel).

 Example: Creating a DataFrame from a dictionary

In [ ]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"]
}
df = pd.DataFrame(data)
print("\nDataFrame:")
print(df)

DataFrame:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

#### b) Accessing Rows, Columns, and Specific Values
 You can access rows and columns in a DataFrame using labels or indices.

 Example: Accessing rows and columns

In [ ]:
print("\nAccessing the 'Name' column:")
print(df["Name"])  # Accessing a column by name

print("\nAccessing the first row:")
print(df.iloc[0])  # Accessing a row by position

print("\nAccessing a specific value:")
print(df.at[2, "City"])  # Accessing by row index and column label

Accessing the 'Name' column:
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

Accessing the first row:
Name       Alice
Age           25
City    New York
Name: 0, dtype: object

Accessing a specific value:
Chicago

#### c) Loading DataFrames from Files
 In Google Colab, you can upload files using the `files` module.

In [ ]:
from google.colab import files
# Upload a file
# Uncomment the following line to upload a CSV file manually
uploaded = files.upload()

# Example: Loading a CSV file (assuming you uploaded 'data.csv')
df_csv = pd.read_csv("Data.csv",encoding= 'unicode_escape')
print("\nLoaded DataFrame:")
print(df_csv.head())  # Display the first 5 rows

Saving Data.csv to Data (3).csv

Loaded DataFrame:
   1   Eldon Base for stackable storage shelf, platinum Muhammed MacIntyre  \
0  2  1.7 Cubic Foot Compact "Cube" Office Refrigera...       Barry French
1  3   Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl       Barry French
2  4                                               R380      Clay Rozendal
3  5                           Holmes HEPA Air Purifier     Carlos Soltero
4  6  G.E. Longer-Life Indoor Recessed Floodlight Bulbs     Carlos Soltero

     3  -213.25   38.94     35  Nunavut          Storage & Organization   0.8
0  293   457.81  208.16  68.02  Nunavut                      Appliances  0.58
1  293    46.71    8.69   2.99  Nunavut  Binders and Binder Accessories  0.39
2  483  1198.97  195.99   3.99  Nunavut    Telephones and Communication  0.58
3  515    30.94   21.78   5.94  Nunavut                      Appliances  0.50
4  515     4.43    6.64   4.95  Nunavut              Office Furnishings  0.37

#### d) Using Built-in Datasets
 For convenience, let's use the Titanic dataset from seaborn.

In [ ]:
import seaborn as sns

titanic = sns.load_dataset("titanic")  # Load Titanic dataset
print("\nFirst 5 rows of the Titanic dataset:")
print(titanic.head())

First 5 rows of the Titanic dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True


#### e) Basic Operations on DataFrames
 DataFrames come with several handy methods for exploration and analysis.

 Example: Basic operations

In [ ]:
print("\nBasic Information about the Titanic DataFrame:")
print(titanic.info())  # Summary of the DataFrame

print("\nSummary Statistics of Numeric Columns:")
print(titanic.describe())  # Summary statistics for numeric columns

Basic Information about the Titanic DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

Summary Statistics of Numeric Columns:
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
import pandas as pd
temperatures = pd.Series([22, 24, 21, 20, 23, 25, 22])
average_temperature = temperatures.mean()
print("Average temperature:", average_temperature)

Average temperature: 22.428571428571427

### 4. Practice Exercises

#### Exercise 1: Create a Series with Temperatures and Calculate Their Average
 - Create a Series of 7 temperatures (e.g., one for each day of the week).
 - Calculate the average temperature using the `.mean()` method.

 Solution:

In [ ]:
temps = pd.Series([29, 31, 28, 33, 30, 27, 32], index=["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"])
print("\nTemperature Series:")
print(temps)
print("Average Temperature:", temps.mean())

Temperature Series:
Sun    29
Mon    31
Tue    28
Wed    33
Thu    30
Fri    27
Sat    32
dtype: int64
Average Temperature: 30.0

In [ ]:

import pandas as pd
temp= pd.Series([30, 32, 28, 29, 31, 33, 30], index=['Mon', 'Tue', 'Wed', 'Thur', 'Fri', 'Sat', 'Sun'])
avg_temp = temp.mean()
print("Temperatures for the week:")
print(temp)
print(f"\nAverage temperature: {avg_temp:.2f}°C")

Temperatures for the week:
Mon     30
Tue     32
Wed     28
Thur    29
Fri     31
Sat     33
Sun     30
dtype: int64

Average temperature: 30.43°C

In [ ]:
import pandas as pd
temperatures = pd.Series([37,28,29,26,27,35,39])
average_tempetarure = temperatures.mean()
print("Temparature for the week:")
print(temp)
print(f"\n average temperature: {avg_temp:.3f}°C")

Temparature for the week:
Mon     30
Tue     32
Wed     28
Thur    29
Fri     31
Sat     33
Sun     30
dtype: int64

 average temperature: 30.429°C

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
print(titanic.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [ ]:
import seaborn as sns

import pandas as pd

# Load Titanic dataset

titanic = sns.load_dataset('titanic')

# Display first 10 rows
print(titanic.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [ ]:
import seaborn as sns
boat = sns.load_dataset('titanic')
print(boat.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
print(titanic.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False


#### Exercise 2: Load a Dataset and Display the First 10 Rows
 - Load the Titanic dataset (or another dataset of your choice) using seaborn.
 - Display the first 10 rows using.

 Solution:

In [ ]:
print("\nFirst 10 rows of the Titanic dataset:")
print(titanic.head(10))

First 10 rows of the Titanic dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic_name_age = titanic[['sex', 'age']]
age_stats = titanic_name_age['age'].describe()
print("Extracted Name and Age columns:")
print(titanic_name_age.head())

print("\nBasic Statistics for 'Age' column:")
print(age_stats)

Extracted Name and Age columns:
      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

Basic Statistics for 'Age' column:
count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [ ]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
name_age_df = titanic[['sex', 'age']]
print(name_age_df.head(5))
age_stats = titanic['age'].describe()
print(age_stats)

      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0
count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
extracted_data = df[['Name', 'Age']]
print(extracted_data.head())
age_statistics = df['Age'].describe()
print(age_statistics)

 #### Exercise 3: Extract Specific Columns and Calculate Basic Statistics
 - Extract the "sex" and "age" columns from the Titanic dataset.
 - Calculate basic statistics for the "age" column.

 Solution:

In [ ]:
name_and_age = titanic[["sex", "age"]]  # 'sex' instead of 'name' in Titanic dataset
print("\nSex and Age Columns:")
print(name_and_age.head())

print("\nBasic Statistics for Age:")
print(titanic["age"].describe())

Sex and Age Columns:
      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

Basic Statistics for Age:
count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64


 ### Conclusion
 In this session, we explored Pandas' core data structures: Series and DataFrames.
 We learned how to create, manipulate, and analyze data using these structures. Practice these exercises to deepen your understanding of Pandas!

 ## Data Cleaning and Preprocessing

 ### Goal:
 Teach data preparation techniques for ensuring clean and structured datasets.

In [ ]:
import pandas as pd
import numpy as np

# ---
 ### 1. Identifying and Handling Duplicates
 Duplicate data can affect analysis and model performance. Pandas provides tools to identify and remove duplicates.

 #### Example: Drop Duplicate Rows
 Create a sample DataFrame with duplicate rows

In [ ]:
data = {
    "Name": ["Alice", "Bob", "Alice", "Charlie", "Bob"],
    "Age": [25, 30, 25, 35, 30],
    "City": ["New York", "Los Angeles", "New York", "Chicago", "Los Angeles"]
}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2    Alice   25     New York
3  Charlie   35      Chicago
4      Bob   30  Los Angeles

In [ ]:
# Identify duplicates using .duplicated()
print("\nDuplicate Rows (True means duplicate):")
print(df.duplicated())

# Remove duplicate rows using .drop_duplicates()
df_no_duplicates = df.drop_duplicates()
print("\nDataFrame after removing duplicates:")
print(df_no_duplicates)

Duplicate Rows (True means duplicate):
0    False
1    False
2     True
3    False
4     True
dtype: bool

DataFrame after removing duplicates:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
3  Charlie   35      Chicago

 ### 2. Renaming Columns and Reindexing
 Renaming columns is helpful for clarity and consistency.

 #### Example: Rename Columns
 Rename columns using the .rename() method

In [ ]:
df_renamed = df_no_duplicates.rename(columns={"Name": "Full Name", "Age": "Age (Years)"})
print("\nDataFrame with Renamed Columns:")
print(df_renamed)

DataFrame with Renamed Columns:
  Full Name  Age (Years)         City
0     Alice           25     New York
1       Bob           30  Los Angeles
3   Charlie           35      Chicago

#### Example: Reindexing Rows
 Reindexing resets the row indices in a DataFrame

In [ ]:
df_no_duplicates = df_no_duplicates.set_index('Name')
df_no_duplicates

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago

In [ ]:
df_no_duplicates = df_no_duplicates.set_index('Name')
df_no_duplicates
df_reindexed = df_no_duplicates.reset_index(drop=True)
print("\nDataFrame with Reindexed Rows:")
print(df_reindexed)

DataFrame with Reindexed Rows:
   Age         City
0   25     New York
1   30  Los Angeles
2   35      Chicago

 ### 3. Data Type Conversions
 DataFrames often have columns with incorrect data types. For example, numbers stored as strings or dates stored as objects.
 #### Example: Convert Strings to Numeric
 Create a DataFrame with a column of strings representing numbers

In [ ]:
data_with_strings = {
    "ID": [1, 2, 3],
    "Value": ["100", "200", "NaN"]
}
df_strings = pd.DataFrame(data_with_strings)
print("\nDataFrame with String Values:")
print(df_strings)
print(df_strings.dtypes)

DataFrame with String Values:
   ID Value
0   1   100
1   2   200
2   3   NaN
ID        int64
Value    object
dtype: object

In [ ]:
# Convert the "Value" column to numeric using pd.to_numeric()
df_strings["Value"] = pd.to_numeric(df_strings["Value"], errors="coerce")
print("\nDataFrame after Converting 'Value' to Numeric:")
print(df_strings)
print(df_strings.dtypes)

DataFrame after Converting 'Value' to Numeric:
   ID  Value
0   1  100.0
1   2  200.0
2   3    NaN
ID         int64
Value    float64
dtype: object


 #### Example: Convert Strings to Datetime
 Create a DataFrame with dates stored as strings

In [ ]:
data_with_dates = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Join Date": ["2023-01-15", "2023-05-20", "2023-07-01"]
}
df_dates = pd.DataFrame(data_with_dates)
print("\nDataFrame with Date Strings:")
print(df_dates)
print(df_dates.dtypes)

DataFrame with Date Strings:
      Name   Join Date
0    Alice  2023-01-15
1      Bob  2023-05-20
2  Charlie  2023-07-01
Name         object
Join Date    object
dtype: object

In [ ]:
# Convert the "Join Date" column to datetime
df_dates["Join Date"] = pd.to_datetime(df_dates["Join Date"])
print("\nDataFrame after Converting 'Join Date' to Datetime:")
print(df_dates)
print(df_dates.dtypes)

DataFrame after Converting 'Join Date' to Datetime:
      Name  Join Date
0    Alice 2023-01-15
1      Bob 2023-05-20
2  Charlie 2023-07-01
Name                 object
Join Date    datetime64[ns]
dtype: object

 ### 4. Dropping Unnecessary Columns or Rows
 Sometimes, certain columns or rows do not contribute to the analysis and need to be removed.

 #### Example: Drop Columns
 Drop the "City" column from the original DataFrame

In [ ]:
df_dropped_columns = df_no_duplicates.drop(columns=["City"])
print("\nDataFrame after Dropping 'City' Column:")
print(df_dropped_columns)

DataFrame after Dropping 'City' Column:
         Age
Name
Alice     25
Bob       30
Charlie   35

 #### Example: Drop Rows with Missing Values
 Create a sample DataFrame with missing values

In [ ]:
data_with_missing = {
    "Name": ["Alice", "Bob", np.nan, "David"],
    "Age": [25, 30, np.nan, 40],
    "City": ["New York", "Los Angeles", "Chicago", np.nan]
}
df_missing = pd.DataFrame(data_with_missing)
print("\nDataFrame with Missing Values:")
print(df_missing)

DataFrame with Missing Values:
    Name   Age         City
0  Alice  25.0     New York
1    Bob  30.0  Los Angeles
2    NaN   NaN      Chicago
3  David  40.0          NaN

In [ ]:

# Drop rows with missing values
df_no_missing = df_missing.dropna()
print("\nDataFrame after Dropping Rows with Missing Values:")
print(df_no_missing)

DataFrame after Dropping Rows with Missing Values:
    Name   Age         City
0  Alice  25.0     New York
1    Bob  30.0  Los Angeles

In [ ]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
duplicates = titanic.duplicated()
print(f"Number of duplicate rows: {duplicates.sum()}")
titanic_cleaned = titanic.drop_duplicates()
print(titanic_cleaned)

Number of duplicate rows: 107
     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0           0       3    male  22.0      1      0   7.2500        S  Third
1           1       1  female  38.0      1      0  71.2833        C  First
2           1       3  female  26.0      0      0   7.9250        S  Third
3           1       1  female  35.0      1      0  53.1000        S  First
4           0       3    male  35.0      0      0   8.0500        S  Third
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
885         0       3  female  39.0      0      5  29.1250        Q  Third
887         1       1  female  19.0      0      0  30.0000        S  First
888         0       3  female   NaN      1      2  23.4500        S  Third
889         1       1    male  26.0      0      0  30.0000        C  First
890         0       3    male  32.0      0      0   7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[784 rows x 15 columns]

In [ ]:
import seaborn as sns
df = sns.load_dataset('titanic')
print("Original dataset:")
print(df.head())
duplicates = df[df.duplicated()]
print("\nDuplicate rows:")
print(duplicates)
df_cleaned = df.drop_duplicates()
print("\nDataset after removing duplicates:")
print(df_cleaned.head())

Original dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

Duplicate rows:
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
47          1       3  female   NaN      0      0   7.7500        Q   Third
76          0       3    male   NaN      0      0   7.8958        S   Third
77          0       3    male   NaN      0      0   8.0500        S   Third
87          0       3    male   NaN      0      0   8.0500        S   Third
95          0       3    male   NaN      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
870         0       3    male  26.0      0      0   7.8958        S   Third
877         0       3    male  19.0      0      0   7.8958        S   Third
878         0       3    male   NaN      0      0   7.8958        S   Third
884         0       3    male  25.0      0      0   7.0500        S   Third
886         0       2    male  27.0      0      0  13.0000        S  Second

       who  adult_male deck  embark_town alive  alone
47   woman       False  NaN   Queenstown   yes   True
76     man        True  NaN  Southampton    no   True
77     man        True  NaN  Southampton    no   True
87     man        True  NaN  Southampton    no   True
95     man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
870    man        True  NaN  Southampton    no   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
886    man        True  NaN  Southampton    no   True

[107 rows x 15 columns]

Dataset after removing duplicates:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

# ---
 ### Practice Exercises

 #### Exercise 1: Identify Duplicate Rows and Remove Them
 - Load the Titanic dataset from seaborn.
 - Identify duplicate rows in the dataset and remove them.

In [ ]:

import seaborn as sns

In [ ]:
# Load the Titanic dataset
titanic = sns.load_dataset("titanic")
print("\nTitanic Dataset:")
print(titanic.head())

# Identify duplicates
duplicates = titanic.duplicated()
print("\nNumber of Duplicate Rows in Titanic Dataset:", duplicates.sum())

# Remove duplicates
titanic_no_duplicates = titanic.drop_duplicates()
print("\nTitanic Dataset after Removing Duplicates:")
print(titanic_no_duplicates.head())

Titanic Dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

Number of Duplicate Rows in Titanic Dataset: 107

Titanic Dataset after Removing Duplicates:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [ ]:
import seaborn as sns
df = sns.load_dataset('titanic')
df.rename(columns={'embark_town': 'Embarkation Town', 'fare': 'Ticket Fare'}, inplace=True)
print(df.head())

   survived  pclass     sex   age  sibsp  parch  Ticket Fare embarked  class  \
0         0       3    male  22.0      1      0       7.2500        S  Third
1         1       1  female  38.0      1      0      71.2833        C  First
2         1       3  female  26.0      0      0       7.9250        S  Third
3         1       1  female  35.0      1      0      53.1000        S  First
4         0       3    male  35.0      0      0       8.0500        S  Third

     who  adult_male deck Embarkation Town alive  alone
0    man        True  NaN      Southampton    no  False
1  woman       False    C        Cherbourg   yes  False
2  woman       False  NaN      Southampton   yes   True
3  woman       False    C      Southampton   yes  False
4    man        True  NaN      Southampton    no   True

In [ ]:
=

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'Ticket Fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')


#### Exercise 2: Rename Columns in the Titanic Dataset
 - Rename the "embark_town" column to "Embarkation Town".
 - Rename the "fare" column to "Ticket Fare".

In [ ]:
titanic_renamed = titanic.rename(columns={"embark_town": "Embarkation Town", "fare": "Ticket Fare"})
print("\nTitanic Dataset with Renamed Columns:")
print(titanic_renamed.head())

In [ ]:
import pandas as pd
date_data = {
    "Event": ["Event A", "Event B", "Event C"],
    "Date": ["2024-01-01", "2023-12-25", "2024-07-04"]
}
df = pd.DataFrame(date_data)
df['Date'] = pd.to_datetime(df['Date'])
df['Year'] = df['Date'].dt.year
print(df)
print(df.dtypes)

     Event       Date  Year
0  Event A 2024-01-01  2024
1  Event B 2023-12-25  2023
2  Event C 2024-07-04  2024
Event            object
Date     datetime64[ns]
Year              int32
dtype: object

In [ ]:
import pandas as pd
date_data = {
    "Event": ["Event A", "Event B", "Event C"],
    "Date": ["2024-01-01", "2023-12-25", "2024-07-04"]
}

df = pd.DataFrame(date_data)
df['Date'] = pd.to_datetime(df['Date'])
df['Year'] = df['Date'].dt.year
print(df)
print(df.dtypes)

     Event       Date  Year
0  Event A 2024-01-01  2024
1  Event B 2023-12-25  2023
2  Event C 2024-07-04  2024
Event            object
Date     datetime64[ns]
Year              int32
dtype: object


#### Exercise 3: Convert a Column to Datetime Format
 - Load a dataset with a column of dates stored as strings.
 - Convert the column to `datetime` format and extract the year.

 Create a small dataset with dates stored as strings

In [ ]:
date_data = {
    "Event": ["Event A", "Event B", "Event C"],
    "Date": ["2024-01-01", "2023-12-25", "2024-07-04"]
}
df_event_dates = pd.DataFrame(date_data)
print("\nDataset with Dates as Strings:")
print(df_event_dates)


### Conclusion
 In this session, we covered data cleaning and preprocessing techniques, including handling duplicates, renaming columns, converting data types, and dropping unnecessary data. These techniques are crucial for preparing datasets for analysis and modeling.

 ## Handling Missing Data
 ### Goal:
 Understand strategies to deal with missing or incomplete data.

In [ ]:
import pandas as pd
import numpy as np

 ### 1. Identifying Missing Values
 Missing values can significantly impact data analysis and modeling. Identifying them is the first step.

 #### Example: Detect Missing Values
 Create a sample DataFrame with missing values

In [ ]:

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, np.nan, 35, 40, np.nan],
    "City": ["New York", "Los Angeles", np.nan, "Chicago", "Houston"]
}
df = pd.DataFrame(data)
print("Original DataFrame:")

print(df)

Original DataFrame:
      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0          NaN
3    David  40.0      Chicago
4      Eve   NaN      Houston

In [ ]:
# Use isnull() to detect missing values
print("\nMissing Values (True indicates missing):")
print(df.isnull())

# Use notnull() to detect non-missing values
print("\nNon-Missing Values (True indicates present):")
print(df.notnull())

Missing Values (True indicates missing):
    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

Non-Missing Values (True indicates present):
   Name    Age   City
0  True   True   True
1  True  False   True
2  True   True  False
3  True   True   True
4  True  False   True


 ### 2. Filling Missing Values
 Replace missing values with placeholders or meaningful values.

 #### Example: Fill Missing Values with a Placeholder

In [ ]:
df_filled_placeholder = df.fillna("Unknown")
print("\nDataFrame with Missing Values Replaced by 'Unknown':")
print(df_filled_placeholder)

DataFrame with Missing Values Replaced by 'Unknown':
      Name      Age         City
0    Alice     25.0     New York
1      Bob  Unknown  Los Angeles
2  Charlie     35.0      Unknown
3    David     40.0      Chicago
4      Eve  Unknown      Houston


 #### Example: Fill Missing Values with Column Mean
 For numeric columns, replacing with the mean is common

In [ ]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
print("\nDataFrame with Missing Ages Replaced by Mean:")
print(df)

DataFrame with Missing Ages Replaced by Mean:
      Name        Age         City
0    Alice  25.000000     New York
1      Bob  33.333333  Los Angeles
2  Charlie  35.000000          NaN
3    David  40.000000      Chicago
4      Eve  33.333333      Houston


 ### 3. Dropping Rows or Columns with Missing Data
 If a row or column has too many missing values, you can drop it.

 #### Example: Drop Rows with Missing Data
 Drop rows where any value is missing

In [ ]:
df_dropped_rows = df.dropna()
print("\nDataFrame after Dropping Rows with Missing Values:")
print(df_dropped_rows)

DataFrame after Dropping Rows with Missing Values:
    Name        Age         City
0  Alice  25.000000     New York
1    Bob  33.333333  Los Angeles
3  David  40.000000      Chicago
4    Eve  33.333333      Houston

 #### Example: Drop Columns with Missing Data
 Drop columns where any value is missing

In [ ]:
df_dropped_columns = df.dropna(axis=1)
print("\nDataFrame after Dropping Columns with Missing Values:")
print(df_dropped_columns)

DataFrame after Dropping Columns with Missing Values:
      Name        Age
0    Alice  25.000000
1      Bob  33.333333
2  Charlie  35.000000
3    David  40.000000
4      Eve  33.333333

 ### 4. Interpolating Missing Values
 For continuous data, you can use interpolation to estimate missing values.

 #### Example: Interpolate Missing Values
 Create a DataFrame with missing values in a sequence

In [ ]:
time_series_data = {
    "Day": [1, 2, 3, 4, 5],
    "Temperature": [30, np.nan, 35, np.nan, 40]
}
df_time_series = pd.DataFrame(time_series_data)
print("\nTime Series DataFrame with Missing Values:")
print(df_time_series)

Time Series DataFrame with Missing Values:
   Day  Temperature
0    1         30.0
1    2          NaN
2    3         35.0
3    4          NaN
4    5         40.0

In [ ]:
# Interpolate missing values
df_time_series["Temperature"] = df_time_series["Temperature"].interpolate()
print("\nTime Series DataFrame after Interpolation:")
print(df_time_series)

Time Series DataFrame after Interpolation:
   Day  Temperature
0    1         30.0
1    2         32.5
2    3         35.0
3    4         37.5
4    5         40.0

In [ ]:
import pandas as pd
# titanic = pd.read_csv('titanic.csv')
titanic=sns.load_dataset("titanic")
missing_percentage = titanic.isnull().mean() * 100
print(missing_percentage.sort_values(ascending=False))
print("\nCleaning Strategies:")
for col, perc in missing_percentage.items():
    if perc > 50:
        print(f"Column '{col}' has {perc:.2f}%" )

deck           77.216611
age            19.865320
embarked        0.224467
embark_town     0.224467
survived        0.000000
pclass          0.000000
sex             0.000000
sibsp           0.000000
parch           0.000000
fare            0.000000
class           0.000000
who             0.000000
adult_male      0.000000
alive           0.000000
alone           0.000000
dtype: float64

Cleaning Strategies:
Column 'deck' has 77.22%

 ### Practice Exercises

 #### Exercise 1: Identify Percentage of Missing Data
 - Load the Titanic dataset from seaborn.
 - Calculate the percentage of missing data for each column and decide on a cleaning strategy.

In [ ]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
missing_data_percentage =titanic.isnull().mean() * 100
print(missing_data_percentage)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [ ]:

import seaborn as sns

# Load Titanic dataset
titanic = sns.load_dataset("titanic")
print("\nTitanic Dataset:")
print(titanic.head())

# Calculate the percentage of missing data
missing_percentage = titanic.isnull().mean() * 100
print("\nPercentage of Missing Data in Each Column:")
print(missing_percentage)

Titanic Dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

Percentage of Missing Data in Each Column:
survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64



 #### Exercise 2: Replace Missing Values with Median
 - Replace missing values in the "age" column with its median.

In [ ]:
import pandas as pd
# titanic = pd.read_csv('titanic.csv')
age_median = titanic['age'].median()
titanic['age'].fillna(age_median, inplace=True)
print(f"Missing values in 'age': {titanic['age'].isnull().sum()}")

Missing values in 'age': 0

<ipython-input-20-31f6cf838d8c>:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['age'].fillna(age_median, inplace=True)

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic['age'] = titanic['age'].fillna(titanic['age'].median())
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [ ]:

titanic["age"] = titanic["age"].fillna(titanic["age"].median())
print("\n'Titanic' Dataset after Replacing Missing 'age' with Median:")
print(titanic[["age"]].head())

'Titanic' Dataset after Replacing Missing 'age' with Median:
    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

 #### Exercise 3: Interpolate Missing Values in a Time-Series Dataset
 - Create a time-series dataset with missing values and interpolate them.

In [ ]:

time_series_with_gaps = {
    "Date": pd.date_range(start="2023-01-01", periods=7),
    "Value": [10, np.nan, 15, np.nan, 20, np.nan, 25]
}
df_time_series_with_gaps = pd.DataFrame(time_series_with_gaps)
print("\nTime-Series Data with Gaps:")
print(df_time_series_with_gaps)

# Interpolate missing values
df_time_series_with_gaps["Value"] = df_time_series_with_gaps["Value"].interpolate()
print("\nTime-Series Data after Interpolation:")
print(df_time_series_with_gaps)

# ---

Time-Series Data with Gaps:
        Date  Value
0 2023-01-01   10.0
1 2023-01-02    NaN
2 2023-01-03   15.0
3 2023-01-04    NaN
4 2023-01-05   20.0
5 2023-01-06    NaN
6 2023-01-07   25.0

Time-Series Data after Interpolation:
        Date  Value
0 2023-01-01   10.0
1 2023-01-02   12.5
2 2023-01-03   15.0
3 2023-01-04   17.5
4 2023-01-05   20.0
5 2023-01-06   22.5
6 2023-01-07   25.0

In [ ]:
import pandas as pd
import numpy as np
time_series_with_gaps = {
    "Date": pd.date_range(start="2023-01-01", periods=7),
    "Value": [10, np.nan, 15, np.nan, 20, np.nan, 25]
}
time_series_df = pd.DataFrame(time_series_with_gaps)
time_series_df['Value'] = time_series_df['Value'].interpolate()
print(time_series_df)

        Date  Value
0 2023-01-01   10.0
1 2023-01-02   12.5
2 2023-01-03   15.0
3 2023-01-04   17.5
4 2023-01-05   20.0
5 2023-01-06   22.5
6 2023-01-07   25.0

In [ ]:
import pandas as pd
import numpy as np
time_series_with_gaps = {
    "Date": pd.date_range(start="2023-01-01", periods=7),
    "Value": [10, np.nan, 15, np.nan, 20, np.nan, 25]
}
df = pd.DataFrame(time_series_with_gaps)
print("Original Time-Series with Missing Values:")
print(df)
df['Value'] = df['Value'].interpolate(method='linear')
print("\nTime-Series After Interpolation:")
print(df)

Original Time-Series with Missing Values:
        Date  Value
0 2023-01-01   10.0
1 2023-01-02    NaN
2 2023-01-03   15.0
3 2023-01-04    NaN
4 2023-01-05   20.0
5 2023-01-06    NaN
6 2023-01-07   25.0

Time-Series After Interpolation:
        Date  Value
0 2023-01-01   10.0
1 2023-01-02   12.5
2 2023-01-03   15.0
3 2023-01-04   17.5
4 2023-01-05   20.0
5 2023-01-06   22.5
6 2023-01-07   25.0


 ### Conclusion
 In this session, we covered strategies to handle missing data, including identifying missing values, filling them with meaningful replacements, dropping incomplete rows/columns, and using interpolation for continuous data.

 ## Merging and Aggregations
 ### Goal:
 Learn how to combine datasets and summarize data effectively.

In [ ]:

import pandas as pd
import numpy as np

 ---
 ### 1. Merging Datasets
 Merging combines two datasets based on a common key.

 #### Example: Perform an Inner Join
Create two sample DataFrames

In [ ]:
df_customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})

df_purchases = pd.DataFrame({
    "CustomerID": [1, 2, 4, 5],
    "PurchaseAmount": [250, 400, 150, 300]
})

print("Customers DataFrame:")
print(df_customers)

print("\nPurchases DataFrame:")
print(df_purchases)

Customers DataFrame:
   CustomerID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David

Purchases DataFrame:
   CustomerID  PurchaseAmount
0           1             250
1           2             400
2           4             150
3           5             300

In [ ]:

# Perform an inner join on "CustomerID"
df_inner_join = pd.merge(df_customers, df_purchases, on="CustomerID", how="inner")
print("\nInner Join Result:")
print(df_inner_join)

Inner Join Result:
   CustomerID   Name  PurchaseAmount
0           1  Alice             250
1           2    Bob             400
2           4  David             150

In [ ]:
# #### Example: Perform an Outer Join
df_outer_join = pd.merge(df_customers, df_purchases, on="CustomerID", how="outer")
print("\nOuter Join Result:")
print(df_outer_join)

Outer Join Result:
   CustomerID     Name  PurchaseAmount
0           1    Alice           250.0
1           2      Bob           400.0
2           3  Charlie             NaN
3           4    David           150.0
4           5      NaN           300.0

 ### 2. Concatenating Datasets
 Concatenating combines datasets either vertically (rows) or horizontally (columns).

 #### Example: Vertical Concatenation

In [ ]:
df_sales_q1 = pd.DataFrame({
    "Month": ["Jan", "Feb", "Mar"],
    "Sales": [300, 400, 500]
})

df_sales_q2 = pd.DataFrame({
    "Month": ["Apr", "May", "Jun"],
    "Sales": [450, 350, 600]
})

print("\nQ1 Sales DataFrame:")
print(df_sales_q1)

print("\nQ2 Sales DataFrame:")
print(df_sales_q2)

Q1 Sales DataFrame:
  Month  Sales
0   Jan    300
1   Feb    400
2   Mar    500

Q2 Sales DataFrame:
  Month  Sales
0   Apr    450
1   May    350
2   Jun    600

In [ ]:
# Concatenate vertically
df_vertical_concat = pd.concat([df_sales_q1, df_sales_q2], ignore_index=True)
print("\nVertical Concatenation Result:")
print(df_vertical_concat)

Vertical Concatenation Result:
  Month  Sales
0   Jan    300
1   Feb    400
2   Mar    500
3   Apr    450
4   May    350
5   Jun    600

In [ ]:
# #### Example: Horizontal Concatenation
df_store_info = pd.DataFrame({
    "StoreID": [1, 2],
    "Location": ["Downtown", "Suburbs"]
})

df_store_sales = pd.DataFrame({
    "StoreID": [1, 2],
    "TotalSales": [1000, 1500]
})

print("\nStore Information DataFrame:")
print(df_store_info)

print("\nStore Sales DataFrame:")
print(df_store_sales)

Store Information DataFrame:
   StoreID  Location
0        1  Downtown
1        2   Suburbs

Store Sales DataFrame:
   StoreID  TotalSales
0        1        1000
1        2        1500

In [ ]:
# Concatenate horizontally
df_horizontal_concat = pd.concat([df_store_info, df_store_sales], axis=1)
print("\nHorizontal Concatenation Result:")
print(df_horizontal_concat)

Horizontal Concatenation Result:
   StoreID  Location  StoreID  TotalSales
0        1  Downtown        1        1000
1        2   Suburbs        2        1500


 ---
 ### 3. Aggregations
 Aggregations summarize data based on specific criteria.

 #### Example: Group Data by a Column

In [ ]:
df_employees = pd.DataFrame({
    "Department": ["HR", "Finance", "HR", "IT", "Finance", "IT"],
    "Salary": [50000, 70000, 60000, 80000, 75000, 85000]
})

print("\nEmployees DataFrame:")
print(df_employees)

Employees DataFrame:
  Department  Salary
0         HR   50000
1    Finance   70000
2         HR   60000
3         IT   80000
4    Finance   75000
5         IT   85000

In [ ]:
# Group by "Department" and calculate mean salary
df_grouped = df_employees.groupby("Department")["Salary"].mean().reset_index()
print("\nAverage Salary by Department:")
print(df_grouped)

Average Salary by Department:
  Department   Salary
0    Finance  72500.0
1         HR  55000.0
2         IT  82500.0


 #### Example: Custom Aggregation
 Aggregate multiple statistics

In [ ]:
df_agg = df_employees.groupby("Department")["Salary"].agg(["sum", "mean", "max"]).reset_index()
print("\nAggregated Salary Statistics by Department:")
print(df_agg)

Aggregated Salary Statistics by Department:
  Department     sum     mean    max
0    Finance  145000  72500.0  75000
1         HR  110000  55000.0  60000
2         IT  165000  82500.0  85000

 ---
 ### Practice Exercises

 #### Exercise 1: Merge Two DataFrames
 - Create a DataFrame with customer details and another with purchase history.
 - Perform a left join to retain all customer details.

In [ ]:
import pandas as pd
df_customer_details = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})
df_purchase_history = pd.DataFrame({
    "CustomerID": [2, 4, 5],
    "TotalPurchases": [5, 3, 7]
})
df_merged = pd.merge(df_customer_details, df_purchase_history, on="CustomerID", how="left")
print(df_merged)

   CustomerID     Name  TotalPurchases
0           1    Alice             NaN
1           2      Bob             5.0
2           3  Charlie             NaN
3           4    David             3.0

In [ ]:
import pandas as pd
df_customer_details = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})
df_purchase_history = pd.DataFrame({
    "CustomerID": [2, 4, 5],
    "TotalPurchases": [5, 3, 7]
})
merged_df = pd.merge(df_customer_details, df_purchase_history, on="CustomerID", how="left")
print("Merged DataFrame (left Join):")
print(merged_df)

Merged DataFrame (left Join):
   CustomerID     Name  TotalPurchases
0           1    Alice             NaN
1           2      Bob             5.0
2           3  Charlie             NaN
3           4    David             3.0

In [ ]:
df_customer_details = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})

df_purchase_history = pd.DataFrame({
    "CustomerID": [2, 4, 5],
    "TotalPurchases": [5, 3, 7]
})

In [ ]:
# Perform left join
df_left_join = pd.merge(df_customer_details, df_purchase_history, on="CustomerID", how="left")
print("\nLeft Join Result:")
print(df_left_join)

Left Join Result:
   CustomerID     Name  TotalPurchases
0           1    Alice             NaN
1           2      Bob             5.0
2           3  Charlie             NaN
3           4    David             3.0


 #### Exercise 2: Group and Calculate Average
 - Group the Titanic dataset by "class" and calculate the average "fare".

In [ ]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
avg_fare_by_class = titanic.groupby('class') ['fare'].mean()
print(avg_fare_by_class)

class
First     84.154687
Second    20.662183
Third     13.675550
Name: fare, dtype: float64

<ipython-input-40-9f4478bec407>:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_fare_by_class = titanic.groupby('class') ['fare'].mean()

In [ ]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
average_fare_by_class = titanic.groupby("class")["fare"].mean()
print(average_fare_by_class)

class
First     84.154687
Second    20.662183
Third     13.675550
Name: fare, dtype: float64

<ipython-input-41-6138583b585d>:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  average_fare_by_class = titanic.groupby("class")["fare"].mean()

In [ ]:
import seaborn as sns

# Load Titanic dataset
titanic = sns.load_dataset("titanic")
print("\nTitanic Dataset:")
print(titanic.head())

# Group by "class" and calculate average "fare"
df_class_fare = titanic.groupby("class")["fare"].mean().reset_index()
print("\nAverage Fare by Class:")
print(df_class_fare)


 #### Exercise 3: Concatenate and Sort
 - Create two DataFrames with sales data.
 - Concatenate them and sort by "Sales".

In [ ]:
import pandas as pd
df_sales_part1 = pd.DataFrame({
    "Product": ["A", "B", "C"],
    "Sales": [200, 150, 300]
})
df_sales_part2 = pd.DataFrame({
    "Product": ["D", "E", "F"],
    "Sales": [250, 400, 100]
})
df_combined = pd.concat([df_sales_part1, df_sales_part2])
df_sorted = df_combined.sort_values(by="Sales")
print(df_sorted)

  Product  Sales
2       F    100
1       B    150
0       A    200
0       D    250
2       C    300
1       E    400

In [ ]:
df_sales_part1 = pd.DataFrame({
    "Product": ["A", "B", "C"],
    "Sales": [200, 150, 300]
})

df_sales_part2 = pd.DataFrame({
    "Product": ["D", "E", "F"],
    "Sales": [250, 400, 100]
})

In [ ]:

# Concatenate and sort
df_sales_combined = pd.concat([df_sales_part1, df_sales_part2], ignore_index=True).sort_values("Sales")
print("\nConcatenated and Sorted Sales DataFrame:")
print(df_sales_combined)

Concatenated and Sorted Sales DataFrame:
  Product  Sales
5       F    100
1       B    150
0       A    200
3       D    250
2       C    300
4       E    400

In [ ]:
import pandas as pd
df_sales_part1 = pd.DataFrame({
    "Product": ["A", "B", "C"],
    "Sales": [200, 150, 300]
})
df_sales_part2 = pd.DataFrame({
    "Product": ["D", "E", "F"],
    "Sales": [250, 400, 100]
})
df_sales = pd.concat([df_sales_part1, df_sales_part2], ignore_index=True)
df_sales_sorted = df_sales.sort_values(by='Sales', ascending=False)
print(df_sales_sorted)

  Product  Sales
4       E    400
2       C    300
3       D    250
0       A    200
1       B    150
5       F    100

 ---
 ### Conclusion
 In this session, we learned how to merge datasets using joins, concatenate datasets, and perform aggregations to summarize data effectively.

### Final Project: Data Manipulation with Pandas  

**Goal:**  
Apply the concepts of data cleaning, merging, grouping, and aggregations in a hands-on project to simulate real-world data analysis scenarios.

---

### **Steps to Be Followed**

1. **Load the Dataset**  
   - Use a dataset of your choice (e.g., **Retail Sales** or **COVID-19 Cases**). You can either load a dataset from a library like `seaborn` or use a CSV file hosted online.

2. **Clean the Data**  
   - Identify missing values and handle them using techniques such as replacing with the mean, median, or mode.
   - Drop unnecessary or irrelevant columns.
   - Rename columns to follow a consistent naming convention.

3. **Enhance the Data**  
   - Add a new column derived from existing data (e.g., categorize numeric values into ranges or calculate a ratio).
   - Create a synthetic dataset and merge it with the cleaned dataset.

4. **Analyze the Data**  
   - Group the data by a categorical column and compute summary statistics (e.g., average sales by region, total cases by country).
   - Perform aggregations to gain insights.

5. **Save the Final Dataset**  
   - Export the cleaned and processed dataset to a CSV file for future use.

6. **Practice Questions**  
   - Compute additional insights like averages, sums, or percentages.
   - Visualize relationships in the data using basic plots.

---

### **Alternative Dataset: Retail Sales Dataset**  
Use a **Retail Sales dataset** containing columns like:  
- `Product_ID`, `Store_ID`, `Category`, `Sub-Category`, `Region`, `Sales`, `Quantity`, `Discount`, and `Profit`.  

**Tasks to Perform:**  
1. Handle missing values in `Sales` or `Profit` columns.  
2. Add a new column like `Profit Margin (%) = (Profit / Sales) * 100`.  
3. Merge with a synthetic dataset containing `Store_ID` and `Store Manager Name`.  
4. Group data by `Region` and calculate total sales and average profit margin.  
5. Save the processed dataset to `cleaned_retail_sales.csv`.  

---

In [ ]:
# # Final Project: Data Manipulation with Pandas
# ## Goal:
# Apply the concepts of data cleaning, merging, grouping, and aggregations.

import pandas as pd
import numpy as np

# ---
# ### 1. Create Dummy Retail Sales Dataset
# Retail dataset with missing values and inconsistent column names
retail_data = pd.DataFrame({
    "Product_ID": [101, 102, 103, 104, 105],
    "Store_ID": [1, 2, 2, 3, np.nan],
    "Category": ["Electronics", "Clothing", "Clothing", "Groceries", "Electronics"],
    "Sub_Category": ["Phones", "Shirts", "Pants", "Fruits", "Laptops"],
    "Region": ["North", "South", "South", "West", np.nan],
    "Sales": [5000, 2000, np.nan, 800, 1500],
    "Quantity": [10, 5, 8, 12, np.nan],
    "Profit": [800, 300, 200, 50, 200],
    "Discount (%)": [10, 5, 0, 2, 5]
})

print("Initial Dataset:")
print(retail_data)

# ---
# ### 2. Clean the Data
# #### Handle Missing Values
# Fill missing "Sales" values with the median of the column
median_sales = retail_data["Sales"].median()
retail_data["Sales"] = retail_data["Sales"].fillna(median_sales)

# Fill missing "Store_ID" with the most frequent Store_ID (mode)
mode_store_id = retail_data["Store_ID"].mode()[0]
retail_data["Store_ID"] = retail_data["Store_ID"].fillna(mode_store_id)

# Fill missing "Region" with a placeholder
retail_data["Region"] = retail_data["Region"].fillna("Unknown")

# Replace missing "Quantity" with the column mean
mean_quantity = retail_data["Quantity"].mean()
retail_data["Quantity"] = retail_data["Quantity"].fillna(mean_quantity)

print("\nDataset After Handling Missing Values:")
print(retail_data)

# #### Rename Columns
retail_data = retail_data.rename(columns={"Discount (%)": "Discount_Percentage"})

print("\nDataset After Renaming Columns:")
print(retail_data)

# ---
# ### 3. Enhance the Data
# #### Add a New Column: Profit Margin
retail_data["Profit_Margin (%)"] = (retail_data["Profit"] / retail_data["Sales"]) * 100
print("\nDataset with 'Profit_Margin (%)':")
print(retail_data)

# #### Create a Synthetic Dataset and Merge
# Synthetic dataset with Store_ID and Manager names
manager_data = pd.DataFrame({
    "Store_ID": [1, 2, 3],
    "Store_Manager": ["Alice", "Bob", "Charlie"]
})

# Merge the two datasets
retail_data = pd.merge(retail_data, manager_data, on="Store_ID", how="left")
print("\nDataset After Merging with Synthetic Data:")
print(retail_data)

# ---
# ### 4. Analyze the Data
# #### Group Data by Region and Calculate Summary Statistics
region_summary = retail_data.groupby("Region").agg(
    Total_Sales=("Sales", "sum"),
    Avg_Profit_Margin=("Profit_Margin (%)", "mean")
).reset_index()

print("\nSummary Statistics by Region:")
print(region_summary)

# ---
# ### 5. Save the Cleaned Dataset
output_file = "cleaned_retail_sales.csv"
retail_data.to_csv(output_file, index=False)
print(f"\nCleaned dataset saved to {output_file}!")

# ---
# ### Practice Questions
# 1. Calculate the total quantity sold by Category.
category_summary = retail_data.groupby("Category")["Quantity"].sum().reset_index()
print("\nTotal Quantity Sold by Category:")
print(category_summary)

# 2. Find the Store with the highest total Sales.
store_sales_summary = retail_data.groupby("Store_ID")["Sales"].sum().reset_index()
store_with_max_sales = store_sales_summary.loc[store_sales_summary["Sales"].idxmax()]
print(f"\nStore with Highest Total Sales:\n{store_with_max_sales}")